======
Comment
======

%test comments

---

(document (comment))

======
Text and Comment
======

foo foo foo %test comments

---

(document 
    (text)
    (comment)
)

======
Command and Comment
======

\blank %test comments

---

(document 
  (command 
    (command_name)
    (comment) 
    (command_stop)
  )
)

======
Comment and Command
======

%test comments \blank

---

(document (comment))


======
Multiline Comments
======

% One
% Two 
% Three

---

(document
  (comment)
  (comment)
  (comment)
)
