======
Simple Command
======

\blank

---

(document 
  (command 
    (command_name)
    (command_stop)
  )
)

======
Command with Option Block and Keyword
======

\blank[big]

---

(document 
  (command 
    (command_name) 
    (option_block
      (command_block_start) 
      (keyword)
      (command_block_stop)
    )
    (command_stop)
  )
)

======
Command with Option Block and Two Keywords
======

\blank[big, hat]

---

(document 
  (command 
    (command_name) 
    (option_block 
      (command_block_start)
      (keyword) 
      (keyword)
      (command_block_stop)
    )
    (command_stop)  
  )
)

======
Command with Settings Block and Keyval Pair
======

\blank[big=hat]

---

(document 
  (command 
    (command_name) 
    (settings_block
      (command_block_start) 
      (setting 
        (key) 
        (value 
          (value_text)
        )
      )
      (command_block_stop)
    )
    (command_stop)
  )
)

======
Command with Settings Block with Command as Value
======

\blank[big=\hat]

---

(document 
  (command 
    (command_name) 
    (settings_block
      (command_block_start) 
      (setting 
        (key) 
        (value 
          (command 
            (command_name)
            (command_stop)
          )
        )
      )
      (command_block_stop)
    )
    (command_stop)
  )
)

======
Command with Settings Block with Two Settings
======

\blank[big=hat, small=hat]

---

(document 
  (command 
    (command_name) 
      (settings_block
        (command_block_start) 
        (setting 
          (key) 
          (value 
            (value_text)
          )
        )
        (setting 
          (key) 
          (value 
            (value_text)
          )
        )
        (command_block_stop)
      )
    (command_stop)
  )
)

======
Command with Settings Block with Two Settings and line break
======

\blank
[big=hat, small=hat]

---

(document 
  (command 
    (command_name) 
      (settings_block
        (command_block_start) 
        (setting 
          (key) 
          (value 
            (value_text)
          )
        )
        (setting 
          (key) 
          (value 
            (value_text)
          )
        )
        (command_block_stop)
      )
    (command_stop)
  )
)

======
Command with Settings Block and Two Settings, one with Grouped Value
======

\blank[big=hat, small={hat}]

---

(document
  (command
    (command_name)
    (settings_block
      (command_block_start)
      (setting
        (key)
        (value
          (value_text)
        )
      )
      (setting
        (key)
        (value
          (value_brace_group
            (value_text)
          )
        )
      )
      (command_block_stop)
    )
    (command_stop)
  )
)

======
Command with Option Block and Group
======

\blank[big=hat]{foo}

---

(document 
  (command 
    (command_name) 
    (settings_block 
      (command_block_start)
      (setting (key) (value (value_text)))
      (command_block_stop)
    )
    (command_stop)
  )
  (brace_group 
    (brace_group_start)
    (text)
    (brace_group_stop)
  )
)

======
Command with Settings Block and Two Settings with newlines
======

\blank[big=hat, 
       small=hat]

---

(document 
  (command 
    (command_name) 
    (settings_block 
      (command_block_start)
      (setting (key) (value (value_text)))
      (setting (key) (value (value_text)))
      (command_block_stop)
    )
    (command_stop)
  )
)

======
Complicated Command and Option Block
======

\setvariables[local]
        [short_title={Lab01},
        title={Setting Up},
        subtitle={},
        type={Individual}, 
        submit={to GitHub},  
        id=s18hw1,
        version=001,]
        
---

(document 
    (command (command_name) 
      (option_block 
        (command_block_start)
        (keyword)
        (command_block_stop)
      ) 
      (settings_block
        (command_block_start)
        (setting (key) (value (value_brace_group (value_text))))
        (title_setting (title_value (title_brace_group (title_text))))
        (setting (key) (value (value_brace_group)))
        (setting (key) (value (value_brace_group (value_text))))
        (setting (key) (value (value_brace_group (value_text)))) 
        (setting (key) (value (value_text))) 
        (setting (key) (value (value_text)))
        (command_block_stop)
      )
      (command_stop)
    )
    (text)
)


======
Section start and stop
======

\startsection[title={Happy Little Goals}]

Nice.

\stopsection

---

(document
  (command
    (command_name)
    (settings_block
      (command_block_start)
      (title_setting
        (title_value
          (title_brace_group
            (title_text)
          )
        )
      )
      (command_block_stop)
    )
    (command_stop)
  )
  (text)
  (command
    (command_name)
    (command_stop)
  )
)
    
    
======
Section start and stop with escaped char
======

\startsection[title={Happy Little Goals}]

Nice. \%

\stopsection

---

(document
  (command
    (command_name)
    (settings_block
      (command_block_start)
      (title_setting
        (title_value
          (title_brace_group
            (title_text)
          )
        )
      )
      (command_block_stop)
    )
    (command_stop)
  )
  (text)
  (escaped
    (escapechar))
  (text)
  (command
    (command_name)
    (command_stop)
  )
)

======
Command with spaces between option blocks
======

\blank [big] [hat]

---

(document 
  (command 
    (command_name) 
    (option_block
      (command_block_start) 
      (keyword)
      (command_block_stop)
    )
    (option_block
      (command_block_start) 
      (keyword)
      (command_block_stop)
    )
    (command_stop)
  )
)

======
Command with linebreak between option blocks
======

\blank 
  [big] 
  [hat]

---

(document 
  (command 
    (command_name) 
    (option_block
      (command_block_start) 
      (keyword)
      (command_block_stop)
    )
    (option_block
      (command_block_start) 
      (keyword)
      (command_block_stop)
    )
    (command_stop)
  )
)


======
Setuptable with tricky option blocks
======

\setupTABLE[column][1][width=8mm,offset=\dimexpr1mm+2pt,align=flushleft,style=\bfx]

---

(document 
  (command 
    (command_name) 
    (option_block
      (command_block_start) 
      (keyword)
      (command_block_stop)
    ) 
    (option_block
      (command_block_start) 
      (keyword)
      (command_block_stop)
    ) 
    (settings_block
      (command_block_start)
      (setting
        (key)
        (value
          (value_text)))
      (setting
        (key)
        (value
          (command
            (command_name)
            (command_stop)
          )
          (value_text)))
      (setting
        (key)
        (value
          (value_text)))
      (setting
        (key)
        (value
          (command
            (command_name)
            (command_stop)
          )
        )
      )
      (command_block_stop)
    )
    (command_stop)
  )
)
