======
Comment
======

%test comments

---

(document (comment))

======
Text and Comment
======

foo foo foo %test comments

---

(document 
    (text)
    (comment)
)

======
Command and Comment
======

\blank %test comments

---

(document 
    (command (command_name)) (comment)
)

======
Comment and Command
======

%test comments \blank

---

(document (comment))

======
Multi-line Comment
======

% One
% Two
% Three

---

(document (comment))
