======
Simple Command
======

\blank

---

(document (command (command_name)))

======
Command with Option Block and Keyword
======

\blank[big]

---

(document (command (command_name) (optionblock (keyword))))

======
Command with Option Block and Two Keywords
======

\blank[big, hat]

---

(document (command (command_name) (optionblock (keyword) (keyword))))

======
Command with Settings Block and Keyval Pair
======

\blank[big=hat]

---

(document (command (command_name) (settingsblock (setting (key) (value (value_text))))))

======
Command with Settings Block with Command as Value
======

\blank[big=\hat]

---

(document (command (command_name) (settingsblock (setting (key) (value (command (command_name)))))))

======
Command with Settings Block with Two Settings
======

\blank[big=hat, small=hat]

---

(document (command (command_name) 
    (settingsblock 
        (setting (key) (value (value_text)))
        (setting (key) (value (value_text)))
    )
))

======
Command with Settings Block and Two Settings, one with Grouped Value
======

\blank[big=hat, small={hat}]

---

(document
  (command
    (command_name)
    (settingsblock
      (setting
        (key)
        (value
          (value_text)))
      (setting
        (key)
        (value
          (value_brace_group
            (value_text)))))))

======
Command with Option Block and Group
======

\blank[big=hat]{foo}

---

(document 
    (command 
        (command_name) 
        (settingsblock 
            (setting (key) (value (value_text)))
        )
    )
    (brace_group (text))
)

======
Command with Settings Block and Two Settings with newlines
======

\blank[big=hat, 
       small=hat]

---

(document (command (command_name) 
    (settingsblock 
        (setting (key) (value (value_text)))
        (setting (key) (value (value_text)))
    )
))

======
Complicated Command and Option Block
======

\setvariables[local]
        [short_title={Lab01},
        title={Setting Up},
        subtitle={},
        type={Individual}, 
        submit={to GitHub},  
        id=s18hw1,
        version=001,]
        
---

(document 
    (command (command_name) 
        (optionblock (keyword)) 
        (settingsblock 
            (setting (key) (value (value_brace_group (text))))
            (setting (key) (value (value_brace_group (text))))
            (setting (key) (value (value_brace_group)))
            (setting (key) (value (value_brace_group (text))))
            (setting (key) (value (value_brace_group (text)))) 
            (setting (key) (value (value_text))) 
            (setting (key) (value (value_text)))
        )
    )
)

======
Section start and stop
======

\startsection[title={Happy Little Goals}]

Nice little fluffy clouds laying around in the sky being lazy. Use what you see, don't plan it. Maybe there's a happy little bush that lives right there.

A thin paint will stick to a thick paint. That's a crooked tree. We'll send him to Washington. Look at them little rascals. I thought today we would make a happy little stream that's just running through the woods here.

\stopsection

---

    (document
  (command
    (command_name)
    (settingsblock
      (setting
        (key)
        (value
          (value_brace_group
            (value_text))))))
  (text)
  (command
    (command_name)))
======
Section start and stop with escaped char
======

\startsection[title={Happy Little Goals}]

Nice little fluffy clouds laying around in the sky being lazy. \$ Use what you see, don't plan it. Maybe there's a happy little bush that lives right there.

A thin paint will stick to a thick paint. That's a crooked tree. We'll send him to Washington. Look at them little rascals. I thought today we would make a happy little stream that's just running through the woods here.

\stopsection

---

    (document
  (command
    (command_name)
    (settingsblock
      (setting
        (key)
        (value
          (value_brace_group
            (value_text))))))
  (text)
  (escaped
    (escapechar))
  (text)
  (command
    (command_name)))

======
Command with spaces between option blocks
======

\blank [big] [hat]

---

(document 
    (command (command_name) 
        (optionblock (keyword))
        (optionblock (keyword))
    )
)

======
Setuptable with wacky opblocks
======

\setupTABLE[column][1][width=8mm,offset=\dimexpr1mm+2pt,align=flushleft,style=\bfx]

---

(document 
    (command (command_name) 
        (optionblock (keyword)) 
        (optionblock (keyword)) 
        (settingsblock
                  (setting
                    (key)
                    (value
                      (value_text)))
                  (setting
                    (key)
                    (value
                      (command
                        (command_name))
                      (value_text)))
                  (setting
                    (key)
                    (value
                      (value_text)))
                  (setting
                    (key)
                    (value
                      (command
                        (command_name)))))
    )
)
