======
Comment
======

%test comments

---

(document (comment))

======
Text and Comment
======

foo foo foo %test comments

---

(document 
    (text)
    (comment)
)

======
Command and Comment
======

\blank %test comments

---

(document 
    (command 
        (command_name) 
        (command_stop)
    ) 
    (text) 
    (comment)
)

======
Comment and Command
======

%test comments \blank

---

(document (comment))

======
Multiline Comment
======

%foo
%bar
%baz

---

(document (comment))
