======
group brace brace
======

{ }

---

(document (brace_group))

======
group bgroup brace
======

\bgroup }

---

(document (brace_group))

======
group brace egroup
======

{ \egroup

---

(document (brace_group))

======
group bgroup egroup
======

\bgroup \egroup

---

(document (brace_group))


======
group group
======

{{}}

---

(document (brace_group (brace_group)))

======
group with text
======

{foo}

---

(document (brace_group (text)))

======
group with command and text
======

{\it foo}

---

(document (brace_group (command (name)) (text)))

======
command with grouped text
======

\emph {foo}

---

(document (command (name)) (brace_group (text)))
